# 1.Написать программу, которая будет проходить операцию с масивами (використовати
# вбудовані методи по роботі з масивами заборонено):
# 1)Виведіть на екран елементи лінійного масиву (заданий користувачем) у зворотному порядку.

# Модуль для масивів
import numpy as np
#Введень стрічок і стовпчиків
a = int ( input ( 'Введи кількість стрічок:' ))
g = int ( input ( 'Введи кількість стовпчиків:' ))
#Створбєм масив з нулів(цілий тип)
p = np.zeros(( a, g ), dtype = int )
#перебираємо усі елементі стрічки і стовпчика відповідно, з кроком -1,а-1, range не проходить ітерацію
for e in range(a-1,-1-1):
  for f in range(g-1,-1,-1):
#прохидимо кожну ітерацію введених користквачем значень і ми міняємо напрям як вказано у задачі    
    p[e,f] = int(input('A['+str(f+1)+','+str(e+1)+']='))
print (p)    
