import numpy as np
#створюєм масив з нулів (тип цілих чисел)
c = np.zeros((3,3),dtype = int)           
for d in range(3):                                      
    for e in range(3):
#міняємо містями e i d, тоді матриця залишаеться незміною,ітерація йде вертикально      
        c[d,e]=int(input('A['+str(d)+','+str(e)+']='))  
f = np.zeros((3,3),dtype = int)                   
for k in range(3):                                      
    for l in range(3): 
#міняємо містями k i l, тоді матриця залишаеться незміною,ітерація йде вертикально                                   
        f[k,l]=int(input('A['+str(k)+','+str(l)+']='))  
o  = np.zeros((3,3),dtype = int)                   
print(c)
print(f)
'''o[0,0]=c[0,0]*f[0,0]+c[0,1]*f[1,0]+c[0,2]*f[2,0]
o[0,1]=c[0,0]*f[0,1]+c[0,1]*f[1,1]+c[0,2]*f[2,1]
o[0,2]=c[0,0]*f[0,2]+c[0,1]*f[1,2]+c[0,2]*f[2,2]
o[1,0]=c[1,0]*f[0,0]+c[1,1]*f[1,0]+c[1,2]*f[2,0]
o[1,1]=c[1,0]*f[0,1]+c[1,1]*f[1,1]+c[1,2]*f[2,1]
o[1,2]=c[1,0]*f[0,2]+c[1,1]*f[1,2]+c[1,2]*f[2,2]
o[2,0]=c[2,0]*f[0,0]+c[2,1]*f[1,0]+c[2,2]*f[2,0]
o[2,1]=c[2,0]*f[0,1]+c[2,1]*f[1,1]+c[2,2]*f[2,1]
o[2,2]=c[2,0]*f[0,2]+c[2,1]*f[1,2]+c[2,2]*f[2,2]'''
#вказуємо цикл
for d in range(3):
    for e in range(3):
        o[d,e] = c[d,e] * f[d,e]
print(o)
