#у матриці 4*4, що задана користувачем замініть всі від’ємні елементи на 0.
#виведемо матрицю 4*4 за допомогою рандому 

import random
import numpy
h = 4
w = 4
# Створюємо двовимірний масив розміром h*w
r = numpy.zeros ((h, w), dtype = int)
for y in range(4):
    for u in range(4):
        r[y,u]=random.randint(-10,10)
for q in range (h):
    for f in range (w):
       #якщо рандом видасть від'ємні числа то те число заміниться на 0
        if r [q, f] <0:
            r [q, f] = 0
# Виводимо результат обчислень на екран
print ( 'Кінцева матриця:  \n', r)
